tests/Chisel.Tests/ChiseledAppTests.RunTestApp_windows.verified.gv
# Generated by https://github.com/0xced/Chisel

digraph
{
  rankdir=LR
  node [ fontname = "Segoe UI, sans-serif", shape = box, style = filled, fillcolor = aquamarine, color = "#009061", fontcolor = "#333333" ]

  "Azure.Core@1.47.1" -> "Microsoft.Bcl.AsyncInterfaces@8.0.0"
  "Azure.Core@1.47.1" -> "System.ClientModel@1.5.1"
  "Azure.Core@1.47.1" -> "System.Memory.Data@8.0.1"
  "Azure.Identity@1.14.2" -> "Azure.Core@1.47.1"
  "Azure.Identity@1.14.2" -> "Microsoft.Identity.Client@4.73.1"
  "Azure.Identity@1.14.2" -> "Microsoft.Identity.Client.Extensions.Msal@4.73.1"
  "Azure.Identity@1.14.2" -> "System.Memory@4.5.5"
  "Microsoft.Data.SqlClient@6.1.3" -> "Azure.Core@1.47.1"
  "Microsoft.Data.SqlClient@6.1.3" -> "Azure.Identity@1.14.2"
  "Microsoft.Data.SqlClient@6.1.3" -> "Microsoft.Bcl.Cryptography@8.0.0"
  "Microsoft.Data.SqlClient@6.1.3" -> "Microsoft.Data.SqlClient.SNI.runtime@6.0.2"
  "Microsoft.Data.SqlClient@6.1.3" -> "Microsoft.Extensions.Caching.Memory@8.0.1"
  "Microsoft.Data.SqlClient@6.1.3" -> "Microsoft.IdentityModel.JsonWebTokens@7.7.1"
  "Microsoft.Data.SqlClient@6.1.3" -> "Microsoft.IdentityModel.Protocols.OpenIdConnect@7.7.1"
  "Microsoft.Data.SqlClient@6.1.3" -> "Microsoft.SqlServer.Server@1.0.0"
  "Microsoft.Data.SqlClient@6.1.3" -> "System.Configuration.ConfigurationManager@8.0.1"
  "Microsoft.Data.SqlClient@6.1.3" -> "System.Security.Cryptography.Pkcs@8.0.1"
  "Microsoft.Data.SqlClient@6.1.3" -> "System.Text.Json@10.0.12"
  "Microsoft.Extensions.Caching.Abstractions@8.0.0" -> "Microsoft.Extensions.Primitives@8.0.0"
  "Microsoft.Extensions.Caching.Memory@8.0.1" -> "Microsoft.Extensions.Caching.Abstractions@8.0.0"
  "Microsoft.Extensions.Caching.Memory@8.0.1" -> "Microsoft.Extensions.DependencyInjection.Abstractions@8.0.2"
  "Microsoft.Extensions.Caching.Memory@8.0.1" -> "Microsoft.Extensions.Logging.Abstractions@8.0.3"
  "Microsoft.Extensions.Caching.Memory@8.0.1" -> "Microsoft.Extensions.Options@8.0.2"
  "Microsoft.Extensions.Caching.Memory@8.0.1" -> "Microsoft.Extensions.Primitives@8.0.0"
  "Microsoft.Extensions.DependencyModel@10.0.12" -> "System.Text.Encodings.Web@10.0.12"
  "Microsoft.Extensions.DependencyModel@10.0.12" -> "System.Text.Json@10.0.12"
  "Microsoft.Extensions.Logging.Abstractions@8.0.3" -> "Microsoft.Extensions.DependencyInjection.Abstractions@8.0.2"
  "Microsoft.Extensions.Options@8.0.2" -> "Microsoft.Extensions.DependencyInjection.Abstractions@8.0.2"
  "Microsoft.Extensions.Options@8.0.2" -> "Microsoft.Extensions.Primitives@8.0.0"
  "Microsoft.Identity.Client@4.73.1" -> "Microsoft.IdentityModel.Abstractions@7.7.1"
  "Microsoft.Identity.Client@4.73.1" -> "System.Diagnostics.DiagnosticSource@6.0.1"
  "Microsoft.Identity.Client.Extensions.Msal@4.73.1" -> "Microsoft.Identity.Client@4.73.1"
  "Microsoft.Identity.Client.Extensions.Msal@4.73.1" -> "System.Security.Cryptography.ProtectedData@8.0.0"
  "Microsoft.IdentityModel.JsonWebTokens@7.7.1" -> "Microsoft.IdentityModel.Tokens@7.7.1"
  "Microsoft.IdentityModel.Logging@7.7.1" -> "Microsoft.IdentityModel.Abstractions@7.7.1"
  "Microsoft.IdentityModel.Protocols@7.7.1" -> "Microsoft.IdentityModel.Tokens@7.7.1"
  "Microsoft.IdentityModel.Protocols.OpenIdConnect@7.7.1" -> "Microsoft.IdentityModel.Protocols@7.7.1"
  "Microsoft.IdentityModel.Protocols.OpenIdConnect@7.7.1" -> "System.IdentityModel.Tokens.Jwt@7.7.1"
  "Microsoft.IdentityModel.Tokens@7.7.1" -> "Microsoft.IdentityModel.Logging@7.7.1"
  "System.ClientModel@1.5.1" -> "Microsoft.Extensions.Logging.Abstractions@8.0.3"
  "System.ClientModel@1.5.1" -> "System.Memory.Data@8.0.1"
  "System.Configuration.ConfigurationManager@8.0.1" -> "System.Diagnostics.EventLog@8.0.1"
  "System.Configuration.ConfigurationManager@8.0.1" -> "System.Security.Cryptography.ProtectedData@8.0.0"
  "System.Diagnostics.DiagnosticSource@6.0.1" -> "System.Runtime.CompilerServices.Unsafe@6.0.0"
  "System.IdentityModel.Tokens.Jwt@7.7.1" -> "Microsoft.IdentityModel.JsonWebTokens@7.7.1"
  "System.IdentityModel.Tokens.Jwt@7.7.1" -> "Microsoft.IdentityModel.Tokens@7.7.1"
  "System.Text.Json@10.0.12" -> "System.IO.Pipelines@10.0.12"
  "System.Text.Json@10.0.12" -> "System.Text.Encodings.Web@10.0.12"

  "Azure.Core@1.47.1" [ fillcolor = lightcoral, color = "#A42A2A", href="https://www.nuget.org/packages/Azure.Core/1.47.1" ]
  "Azure.Identity@1.14.2" [ fillcolor = lightcoral, color = "#A42A2A", href="https://www.nuget.org/packages/Azure.Identity/1.14.2" ]
  "Microsoft.Bcl.AsyncInterfaces@8.0.0" [ fillcolor = lightcoral, color = "#A42A2A", href="https://www.nuget.org/packages/Microsoft.Bcl.AsyncInterfaces/8.0.0" ]
  "Microsoft.Bcl.Cryptography@8.0.0" [ href="https://www.nuget.org/packages/Microsoft.Bcl.Cryptography/8.0.0" ]
  "Microsoft.Data.SqlClient@6.1.3" [ shape = hexagon, penwidth = 4, href="https://www.nuget.org/packages/Microsoft.Data.SqlClient/6.1.3" ]
  "Microsoft.Data.SqlClient.SNI.runtime@6.0.2" [ href="https://www.nuget.org/packages/Microsoft.Data.SqlClient.SNI.runtime/6.0.2" ]
  "Microsoft.Extensions.Caching.Abstractions@8.0.0" [ href="https://www.nuget.org/packages/Microsoft.Extensions.Caching.Abstractions/8.0.0" ]
  "Microsoft.Extensions.Caching.Memory@8.0.1" [ href="https://www.nuget.org/packages/Microsoft.Extensions.Caching.Memory/8.0.1" ]
  "Microsoft.Extensions.DependencyInjection.Abstractions@8.0.2" [ href="https://www.nuget.org/packages/Microsoft.Extensions.DependencyInjection.Abstractions/8.0.2" ]
  "Microsoft.Extensions.DependencyModel@10.0.12" [ shape = hexagon, penwidth = 4, href="https://www.nuget.org/packages/Microsoft.Extensions.DependencyModel/10.0.12" ]
  "Microsoft.Extensions.Logging.Abstractions@8.0.3" [ href="https://www.nuget.org/packages/Microsoft.Extensions.Logging.Abstractions/8.0.3" ]
  "Microsoft.Extensions.Options@8.0.2" [ href="https://www.nuget.org/packages/Microsoft.Extensions.Options/8.0.2" ]
  "Microsoft.Extensions.Primitives@8.0.0" [ href="https://www.nuget.org/packages/Microsoft.Extensions.Primitives/8.0.0" ]
  "Microsoft.Identity.Client@4.73.1" [ fillcolor = lightcoral, color = "#A42A2A", href="https://www.nuget.org/packages/Microsoft.Identity.Client/4.73.1" ]
  "Microsoft.Identity.Client.Extensions.Msal@4.73.1" [ fillcolor = lightcoral, color = "#A42A2A", href="https://www.nuget.org/packages/Microsoft.Identity.Client.Extensions.Msal/4.73.1" ]
  "Microsoft.IdentityModel.Abstractions@7.7.1" [ fillcolor = lightcoral, color = "#A42A2A", href="https://www.nuget.org/packages/Microsoft.IdentityModel.Abstractions/7.7.1" ]
  "Microsoft.IdentityModel.JsonWebTokens@7.7.1" [ fillcolor = lightcoral, color = "#A42A2A", href="https://www.nuget.org/packages/Microsoft.IdentityModel.JsonWebTokens/7.7.1" ]
  "Microsoft.IdentityModel.Logging@7.7.1" [ fillcolor = lightcoral, color = "#A42A2A", href="https://www.nuget.org/packages/Microsoft.IdentityModel.Logging/7.7.1" ]
  "Microsoft.IdentityModel.Protocols@7.7.1" [ fillcolor = lightcoral, color = "#A42A2A", href="https://www.nuget.org/packages/Microsoft.IdentityModel.Protocols/7.7.1" ]
  "Microsoft.IdentityModel.Protocols.OpenIdConnect@7.7.1" [ fillcolor = lightcoral, color = "#A42A2A", href="https://www.nuget.org/packages/Microsoft.IdentityModel.Protocols.OpenIdConnect/7.7.1" ]
  "Microsoft.IdentityModel.Tokens@7.7.1" [ fillcolor = lightcoral, color = "#A42A2A", href="https://www.nuget.org/packages/Microsoft.IdentityModel.Tokens/7.7.1" ]
  "Microsoft.SqlServer.Server@1.0.0" [ href="https://www.nuget.org/packages/Microsoft.SqlServer.Server/1.0.0" ]
  "System.ClientModel@1.5.1" [ fillcolor = lightcoral, color = "#A42A2A", href="https://www.nuget.org/packages/System.ClientModel/1.5.1" ]
  "System.Configuration.ConfigurationManager@8.0.1" [ href="https://www.nuget.org/packages/System.Configuration.ConfigurationManager/8.0.1" ]
  "System.Diagnostics.DiagnosticSource@6.0.1" [ fillcolor = lightcoral, color = "#A42A2A", href="https://www.nuget.org/packages/System.Diagnostics.DiagnosticSource/6.0.1" ]
  "System.Diagnostics.EventLog@8.0.1" [ href="https://www.nuget.org/packages/System.Diagnostics.EventLog/8.0.1" ]
  "System.IdentityModel.Tokens.Jwt@7.7.1" [ fillcolor = lightcoral, color = "#A42A2A", href="https://www.nuget.org/packages/System.IdentityModel.Tokens.Jwt/7.7.1" ]
  "System.IO.Pipelines@10.0.12" [ href="https://www.nuget.org/packages/System.IO.Pipelines/10.0.12" ]
  "System.Memory@4.5.5" [ fillcolor = lightcoral, color = "#A42A2A", href="https://www.nuget.org/packages/System.Memory/4.5.5" ]
  "System.Memory.Data@8.0.1" [ fillcolor = lightcoral, color = "#A42A2A", href="https://www.nuget.org/packages/System.Memory.Data/8.0.1" ]
  "System.Runtime.CompilerServices.Unsafe@6.0.0" [ fillcolor = lightcoral, color = "#A42A2A", href="https://www.nuget.org/packages/System.Runtime.CompilerServices.Unsafe/6.0.0" ]
  "System.Security.Cryptography.Pkcs@8.0.1" [ href="https://www.nuget.org/packages/System.Security.Cryptography.Pkcs/8.0.1" ]
  "System.Security.Cryptography.ProtectedData@8.0.0" [ href="https://www.nuget.org/packages/System.Security.Cryptography.ProtectedData/8.0.0" ]
  "System.Text.Encodings.Web@10.0.12" [ href="https://www.nuget.org/packages/System.Text.Encodings.Web/10.0.12" ]
  "System.Text.Json@10.0.12" [ href="https://www.nuget.org/packages/System.Text.Json/10.0.12" ]
}
