tests/Chisel.Tests/ChiseledAppTests.RunTestApp_windows.verified.mermaid
%% Generated by https://github.com/0xced/Chisel

graph LR

classDef root stroke-width:4px
classDef default fill:aquamarine,stroke:#009061,color:#333333
classDef removed fill:lightcoral,stroke:#A42A2A

Azure.Core/1.47.1 --> Microsoft.Bcl.AsyncInterfaces/8.0.0
Azure.Core/1.47.1 --> System.ClientModel/1.5.1
Azure.Core/1.47.1 --> System.Memory.Data/8.0.1
Azure.Identity/1.14.2 --> Azure.Core/1.47.1
Azure.Identity/1.14.2 --> Microsoft.Identity.Client/4.73.1
Azure.Identity/1.14.2 --> Microsoft.Identity.Client.Extensions.Msal/4.73.1
Microsoft.Data.SqlClient/6.1.1{{Microsoft.Data.SqlClient/6.1.1}} --> Azure.Core/1.47.1
Microsoft.Data.SqlClient/6.1.1 --> Azure.Identity/1.14.2
Microsoft.Data.SqlClient/6.1.1 --> Microsoft.Bcl.Cryptography/8.0.0
Microsoft.Data.SqlClient/6.1.1 --> Microsoft.Data.SqlClient.SNI.runtime/6.0.2
Microsoft.Data.SqlClient/6.1.1 --> Microsoft.Extensions.Caching.Memory/8.0.1
Microsoft.Data.SqlClient/6.1.1 --> Microsoft.IdentityModel.JsonWebTokens/7.7.1
Microsoft.Data.SqlClient/6.1.1 --> Microsoft.IdentityModel.Protocols.OpenIdConnect/7.7.1
Microsoft.Data.SqlClient/6.1.1 --> Microsoft.SqlServer.Server/1.0.0
Microsoft.Data.SqlClient/6.1.1 --> System.Configuration.ConfigurationManager/8.0.1
Microsoft.Data.SqlClient/6.1.1 --> System.Security.Cryptography.Pkcs/8.0.1
Microsoft.Data.SqlClient/6.1.1 --> System.Text.Json/9.0.8
Microsoft.Extensions.Caching.Abstractions/8.0.0 --> Microsoft.Extensions.Primitives/8.0.0
Microsoft.Extensions.Caching.Memory/8.0.1 --> Microsoft.Extensions.Caching.Abstractions/8.0.0
Microsoft.Extensions.Caching.Memory/8.0.1 --> Microsoft.Extensions.DependencyInjection.Abstractions/8.0.2
Microsoft.Extensions.Caching.Memory/8.0.1 --> Microsoft.Extensions.Logging.Abstractions/8.0.3
Microsoft.Extensions.Caching.Memory/8.0.1 --> Microsoft.Extensions.Options/8.0.2
Microsoft.Extensions.Caching.Memory/8.0.1 --> Microsoft.Extensions.Primitives/8.0.0
Microsoft.Extensions.DependencyModel/9.0.8{{Microsoft.Extensions.DependencyModel/9.0.8}} --> System.Text.Encodings.Web/9.0.8
Microsoft.Extensions.DependencyModel/9.0.8 --> System.Text.Json/9.0.8
Microsoft.Extensions.Logging.Abstractions/8.0.3 --> Microsoft.Extensions.DependencyInjection.Abstractions/8.0.2
Microsoft.Extensions.Options/8.0.2 --> Microsoft.Extensions.DependencyInjection.Abstractions/8.0.2
Microsoft.Extensions.Options/8.0.2 --> Microsoft.Extensions.Primitives/8.0.0
Microsoft.Identity.Client/4.73.1 --> Microsoft.IdentityModel.Abstractions/7.7.1
Microsoft.Identity.Client/4.73.1 --> System.Diagnostics.DiagnosticSource/6.0.1
Microsoft.Identity.Client.Extensions.Msal/4.73.1 --> Microsoft.Identity.Client/4.73.1
Microsoft.Identity.Client.Extensions.Msal/4.73.1 --> System.Security.Cryptography.ProtectedData/8.0.0
Microsoft.IdentityModel.JsonWebTokens/7.7.1 --> Microsoft.IdentityModel.Tokens/7.7.1
Microsoft.IdentityModel.Logging/7.7.1 --> Microsoft.IdentityModel.Abstractions/7.7.1
Microsoft.IdentityModel.Protocols/7.7.1 --> Microsoft.IdentityModel.Tokens/7.7.1
Microsoft.IdentityModel.Protocols.OpenIdConnect/7.7.1 --> Microsoft.IdentityModel.Protocols/7.7.1
Microsoft.IdentityModel.Protocols.OpenIdConnect/7.7.1 --> System.IdentityModel.Tokens.Jwt/7.7.1
Microsoft.IdentityModel.Tokens/7.7.1 --> Microsoft.IdentityModel.Logging/7.7.1
System.ClientModel/1.5.1 --> Microsoft.Extensions.Logging.Abstractions/8.0.3
System.ClientModel/1.5.1 --> System.Memory.Data/8.0.1
System.Configuration.ConfigurationManager/8.0.1 --> System.Diagnostics.EventLog/8.0.1
System.Configuration.ConfigurationManager/8.0.1 --> System.Security.Cryptography.ProtectedData/8.0.0
System.Diagnostics.DiagnosticSource/6.0.1 --> System.Runtime.CompilerServices.Unsafe/6.0.0
System.IdentityModel.Tokens.Jwt/7.7.1 --> Microsoft.IdentityModel.JsonWebTokens/7.7.1
System.IdentityModel.Tokens.Jwt/7.7.1 --> Microsoft.IdentityModel.Tokens/7.7.1
System.Text.Json/9.0.8 --> System.IO.Pipelines/9.0.8
System.Text.Json/9.0.8 --> System.Text.Encodings.Web/9.0.8

class Azure.Core/1.47.1 removed
click Azure.Core/1.47.1 "https://www.nuget.org/packages/Azure.Core/1.47.1" "Azure.Core 1.47.1"
class Azure.Identity/1.14.2 removed
click Azure.Identity/1.14.2 "https://www.nuget.org/packages/Azure.Identity/1.14.2" "Azure.Identity 1.14.2"
class Microsoft.Bcl.AsyncInterfaces/8.0.0 removed
click Microsoft.Bcl.AsyncInterfaces/8.0.0 "https://www.nuget.org/packages/Microsoft.Bcl.AsyncInterfaces/8.0.0" "Microsoft.Bcl.AsyncInterfaces 8.0.0"
class Microsoft.Bcl.Cryptography/8.0.0 default
click Microsoft.Bcl.Cryptography/8.0.0 "https://www.nuget.org/packages/Microsoft.Bcl.Cryptography/8.0.0" "Microsoft.Bcl.Cryptography 8.0.0"
class Microsoft.Data.SqlClient/6.1.1 root
class Microsoft.Data.SqlClient/6.1.1 default
click Microsoft.Data.SqlClient/6.1.1 "https://www.nuget.org/packages/Microsoft.Data.SqlClient/6.1.1" "Microsoft.Data.SqlClient 6.1.1"
class Microsoft.Data.SqlClient.SNI.runtime/6.0.2 default
click Microsoft.Data.SqlClient.SNI.runtime/6.0.2 "https://www.nuget.org/packages/Microsoft.Data.SqlClient.SNI.runtime/6.0.2" "Microsoft.Data.SqlClient.SNI.runtime 6.0.2"
class Microsoft.Extensions.Caching.Abstractions/8.0.0 default
click Microsoft.Extensions.Caching.Abstractions/8.0.0 "https://www.nuget.org/packages/Microsoft.Extensions.Caching.Abstractions/8.0.0" "Microsoft.Extensions.Caching.Abstractions 8.0.0"
class Microsoft.Extensions.Caching.Memory/8.0.1 default
click Microsoft.Extensions.Caching.Memory/8.0.1 "https://www.nuget.org/packages/Microsoft.Extensions.Caching.Memory/8.0.1" "Microsoft.Extensions.Caching.Memory 8.0.1"
class Microsoft.Extensions.DependencyInjection.Abstractions/8.0.2 default
click Microsoft.Extensions.DependencyInjection.Abstractions/8.0.2 "https://www.nuget.org/packages/Microsoft.Extensions.DependencyInjection.Abstractions/8.0.2" "Microsoft.Extensions.DependencyInjection.Abstractions 8.0.2"
class Microsoft.Extensions.DependencyModel/9.0.8 root
class Microsoft.Extensions.DependencyModel/9.0.8 default
click Microsoft.Extensions.DependencyModel/9.0.8 "https://www.nuget.org/packages/Microsoft.Extensions.DependencyModel/9.0.8" "Microsoft.Extensions.DependencyModel 9.0.8"
class Microsoft.Extensions.Logging.Abstractions/8.0.3 default
click Microsoft.Extensions.Logging.Abstractions/8.0.3 "https://www.nuget.org/packages/Microsoft.Extensions.Logging.Abstractions/8.0.3" "Microsoft.Extensions.Logging.Abstractions 8.0.3"
class Microsoft.Extensions.Options/8.0.2 default
click Microsoft.Extensions.Options/8.0.2 "https://www.nuget.org/packages/Microsoft.Extensions.Options/8.0.2" "Microsoft.Extensions.Options 8.0.2"
class Microsoft.Extensions.Primitives/8.0.0 default
click Microsoft.Extensions.Primitives/8.0.0 "https://www.nuget.org/packages/Microsoft.Extensions.Primitives/8.0.0" "Microsoft.Extensions.Primitives 8.0.0"
class Microsoft.Identity.Client/4.73.1 removed
click Microsoft.Identity.Client/4.73.1 "https://www.nuget.org/packages/Microsoft.Identity.Client/4.73.1" "Microsoft.Identity.Client 4.73.1"
class Microsoft.Identity.Client.Extensions.Msal/4.73.1 removed
click Microsoft.Identity.Client.Extensions.Msal/4.73.1 "https://www.nuget.org/packages/Microsoft.Identity.Client.Extensions.Msal/4.73.1" "Microsoft.Identity.Client.Extensions.Msal 4.73.1"
class Microsoft.IdentityModel.Abstractions/7.7.1 removed
click Microsoft.IdentityModel.Abstractions/7.7.1 "https://www.nuget.org/packages/Microsoft.IdentityModel.Abstractions/7.7.1" "Microsoft.IdentityModel.Abstractions 7.7.1"
class Microsoft.IdentityModel.JsonWebTokens/7.7.1 removed
click Microsoft.IdentityModel.JsonWebTokens/7.7.1 "https://www.nuget.org/packages/Microsoft.IdentityModel.JsonWebTokens/7.7.1" "Microsoft.IdentityModel.JsonWebTokens 7.7.1"
class Microsoft.IdentityModel.Logging/7.7.1 removed
click Microsoft.IdentityModel.Logging/7.7.1 "https://www.nuget.org/packages/Microsoft.IdentityModel.Logging/7.7.1" "Microsoft.IdentityModel.Logging 7.7.1"
class Microsoft.IdentityModel.Protocols/7.7.1 removed
click Microsoft.IdentityModel.Protocols/7.7.1 "https://www.nuget.org/packages/Microsoft.IdentityModel.Protocols/7.7.1" "Microsoft.IdentityModel.Protocols 7.7.1"
class Microsoft.IdentityModel.Protocols.OpenIdConnect/7.7.1 removed
click Microsoft.IdentityModel.Protocols.OpenIdConnect/7.7.1 "https://www.nuget.org/packages/Microsoft.IdentityModel.Protocols.OpenIdConnect/7.7.1" "Microsoft.IdentityModel.Protocols.OpenIdConnect 7.7.1"
class Microsoft.IdentityModel.Tokens/7.7.1 removed
click Microsoft.IdentityModel.Tokens/7.7.1 "https://www.nuget.org/packages/Microsoft.IdentityModel.Tokens/7.7.1" "Microsoft.IdentityModel.Tokens 7.7.1"
class Microsoft.SqlServer.Server/1.0.0 default
click Microsoft.SqlServer.Server/1.0.0 "https://www.nuget.org/packages/Microsoft.SqlServer.Server/1.0.0" "Microsoft.SqlServer.Server 1.0.0"
class System.ClientModel/1.5.1 removed
click System.ClientModel/1.5.1 "https://www.nuget.org/packages/System.ClientModel/1.5.1" "System.ClientModel 1.5.1"
class System.Configuration.ConfigurationManager/8.0.1 default
click System.Configuration.ConfigurationManager/8.0.1 "https://www.nuget.org/packages/System.Configuration.ConfigurationManager/8.0.1" "System.Configuration.ConfigurationManager 8.0.1"
class System.Diagnostics.DiagnosticSource/6.0.1 removed
click System.Diagnostics.DiagnosticSource/6.0.1 "https://www.nuget.org/packages/System.Diagnostics.DiagnosticSource/6.0.1" "System.Diagnostics.DiagnosticSource 6.0.1"
class System.Diagnostics.EventLog/8.0.1 default
click System.Diagnostics.EventLog/8.0.1 "https://www.nuget.org/packages/System.Diagnostics.EventLog/8.0.1" "System.Diagnostics.EventLog 8.0.1"
class System.IdentityModel.Tokens.Jwt/7.7.1 removed
click System.IdentityModel.Tokens.Jwt/7.7.1 "https://www.nuget.org/packages/System.IdentityModel.Tokens.Jwt/7.7.1" "System.IdentityModel.Tokens.Jwt 7.7.1"
class System.IO.Pipelines/9.0.8 default
click System.IO.Pipelines/9.0.8 "https://www.nuget.org/packages/System.IO.Pipelines/9.0.8" "System.IO.Pipelines 9.0.8"
class System.Memory.Data/8.0.1 removed
click System.Memory.Data/8.0.1 "https://www.nuget.org/packages/System.Memory.Data/8.0.1" "System.Memory.Data 8.0.1"
class System.Runtime.CompilerServices.Unsafe/6.0.0 removed
click System.Runtime.CompilerServices.Unsafe/6.0.0 "https://www.nuget.org/packages/System.Runtime.CompilerServices.Unsafe/6.0.0" "System.Runtime.CompilerServices.Unsafe 6.0.0"
class System.Security.Cryptography.Pkcs/8.0.1 default
click System.Security.Cryptography.Pkcs/8.0.1 "https://www.nuget.org/packages/System.Security.Cryptography.Pkcs/8.0.1" "System.Security.Cryptography.Pkcs 8.0.1"
class System.Security.Cryptography.ProtectedData/8.0.0 default
click System.Security.Cryptography.ProtectedData/8.0.0 "https://www.nuget.org/packages/System.Security.Cryptography.ProtectedData/8.0.0" "System.Security.Cryptography.ProtectedData 8.0.0"
class System.Text.Encodings.Web/9.0.8 default
click System.Text.Encodings.Web/9.0.8 "https://www.nuget.org/packages/System.Text.Encodings.Web/9.0.8" "System.Text.Encodings.Web 9.0.8"
class System.Text.Json/9.0.8 default
click System.Text.Json/9.0.8 "https://www.nuget.org/packages/System.Text.Json/9.0.8" "System.Text.Json 9.0.8"
